In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.read_csv

In [4]:
ds = pd.read_csv('/content/drive/MyDrive/StudentsPerformance.csv')

In [ ]:
ds.info() 
# This shows that the dataset contains 1000 rows with 8 columns.It also tells the Data types in each column and their various headings

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [ ]:
ds.head() 

#this shows the first fve(5) rows in the DataFrame

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75

[5 rows x 8 columns]

DataFrames comes with indexes. As you can see in the "table" above, pandas has assigned a numeric, autoincremental index automatically to each "row" in the DataFrame

In [ ]:
ds.shape

#it tells us the total rows and columns in the data set

(1000, 8)

In [ ]:
ds.tail()

#this displays the bottom five(5) rows of the Dataset

     gender race/ethnicity  ... reading score writing score
995  female        group E  ...            99            95
996    male        group C  ...            55            55
997  female        group C  ...            71            65
998  female        group D  ...            78            77
999  female        group D  ...            86            86

[5 rows x 8 columns]

In [ ]:
ds.head(3)

#this is me specifying the number(3) of rows to be displaced

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93

[3 rows x 8 columns]

In [ ]:
ds.dtypes

#this shows us the various data types in each column

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [ ]:
ds.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [ ]:
ds['gender']

#this displays all the data entry in the column 'gender'

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [ ]:
ds['math score'].values

#this shows all the data entry in the column 'math score'

array([ 72,  69,  90,  47,  76,  71,  88,  40,  64,  38,  58,  40,  65,
        78,  50,  69,  88,  18,  46,  54,  66,  65,  44,  69,  74,  73,
        69,  67,  70,  62,  69,  63,  56,  40,  97,  81,  74,  50,  75,
        57,  55,  58,  53,  59,  50,  65,  55,  66,  57,  82,  53,  77,
        53,  88,  71,  33,  82,  52,  58,   0,  79,  39,  62,  69,  59,
        67,  45,  60,  61,  39,  58,  63,  41,  61,  49,  44,  30,  80,
        61,  62,  47,  49,  50,  72,  42,  73,  76,  71,  58,  73,  65,
        27,  71,  43,  79,  78,  65,  63,  58,  65,  79,  68,  85,  60,
        98,  58,  87,  66,  52,  70,  77,  62,  54,  51,  99,  84,  75,
        78,  51,  55,  79,  91,  88,  63,  83,  87,  72,  65,  82,  51,
        89,  53,  87,  75,  74,  58,  51,  70,  59,  71,  76,  59,  42,
        57,  88,  22,  88,  73,  68, 100,  62,  77,  59,  54,  62,  70,
        66,  60,  61,  66,  82,  75,  49,  52,  81,  96,  53,  58,  68,
        67,  72,  94,  79,  63,  43,  81,  46,  71,  52,  97,  62,  46,
        50,  65,  45,  65,  80,  62,  48,  77,  66,  76,  62,  77,  69,
        61,  59,  55,  45,  78,  67,  65,  69,  57,  59,  74,  82,  81,
        74,  58,  80,  35,  42,  60,  87,  84,  83,  34,  66,  61,  56,
        87,  55,  86,  52,  45,  72,  57,  68,  88,  76,  46,  67,  92,
        83,  80,  63,  64,  54,  84,  73,  80,  56,  59,  75,  85,  89,
        58,  65,  68,  47,  71,  60,  80,  54,  62,  64,  78,  70,  65,
        64,  79,  44,  99,  76,  59,  63,  69,  88,  71,  69,  58,  47,
        65,  88,  83,  85,  59,  65,  73,  53,  45,  73,  70,  37,  81,
        97,  67,  88,  77,  76,  86,  63,  65,  78,  67,  46,  71,  40,
        90,  81,  56,  67,  80,  74,  69,  99,  51,  53,  49,  73,  66,
        67,  68,  59,  71,  77,  83,  63,  56,  67,  75,  71,  43,  41,
        82,  61,  28,  82,  41,  71,  47,  62,  90,  83,  61,  76,  49,
        24,  35,  58,  61,  69,  67,  79,  72,  62,  77,  75,  87,  52,
        66,  63,  46,  59,  61,  63,  42,  59,  80,  58,  85,  52,  27,
        59,  49,  69,  61,  44,  73,  84,  45,  74,  82,  59,  46,  80,
        85,  71,  66,  80,  87,  79,  38,  38,  67,  64,  57,  62,  73,
        73,  77,  76,  57,  65,  48,  50,  85,  74,  60,  59,  53,  49,
        88,  54,  63,  65,  82,  52,  87,  70,  84,  71,  63,  51,  84,
        71,  74,  68,  57,  82,  57,  47,  59,  41,  62,  86,  69,  65,
        68,  64,  61,  61,  47,  73,  50,  75,  75,  70,  89,  67,  78,
        59,  73,  79,  67,  69,  86,  47,  81,  64, 100,  65,  65,  53,
        37,  79,  53, 100,  72,  53,  54,  71,  77,  75,  84,  26,  72,
        77,  91,  83,  63,  68,  59,  90,  71,  76,  80,  55,  76,  73,
        52,  68,  59,  49,  70,  61,  60,  64,  79,  65,  64,  83,  81,
        54,  68,  54,  59,  66,  76,  74,  94,  63,  95,  40,  82,  68,
        55,  79,  86,  76,  64,  62,  54,  77,  76,  74,  66,  66,  67,
        71,  91,  69,  54,  53,  68,  56,  36,  29,  62,  68,  47,  62,
        79,  73,  66,  51,  51,  85,  97,  75,  79,  81,  82,  64,  78,
        92,  72,  62,  79,  79,  87,  40,  77,  53,  32,  55,  61,  53,
        73,  74,  63,  96,  63,  48,  48,  92,  61,  63,  68,  71,  91,
        53,  50,  74,  40,  61,  81,  48,  53,  81,  77,  63,  73,  69,
        65,  55,  44,  54,  48,  58,  71,  68,  74,  92,  56,  30,  53,
        69,  65,  54,  29,  76,  60,  84,  75,  85,  40,  61,  58,  69,
        58,  94,  65,  82,  60,  37,  88,  95,  65,  35,  62,  58, 100,
        61, 100,  69,  61,  49,  44,  67,  79,  66,  75,  84,  71,  67,
        80,  86,  76,  41,  74,  72,  74,  70,  65,  59,  64,  50,  69,
        51,  68,  85,  65,  73,  62,  77,  69,  43,  90,  74,  73,  55,
        65,  80,  50,  63,  77,  73,  81,  66,  52,  69,  65,  69,  50,
        73,  70,  81,  63,  67,  60,  62,  29,  62,  94,  85,  77,  53,
        93,  49,  73,  66,  77,  49,  79,  75,  59,  57,  66,  79,  57,
        87,  63,  59,  62,  46,  66,  89,  42,  93,  80,  98,  81,  60,
        76,  73,  96,  76,  91,  62,  55,  74,  50,  47,  81,  65,  68,
        73,  53,  68,  55,  87,  55,  53,  67,  92,  53,  81,  61,  80,
        37,  81,  59,  55,  72,  69,  69,  50,  87,  71,  68,  79,  77,
        58,  84,  55,  70,  52,  69,  53,  48,  78,  62,  60,  74,  58,
        76,  68,  58,  52,  75,  52,  62,  66,  49,  66,  35,  72,  94,
        46,  77,  76,  52,  91,  32,  72,  19,  68,  52,  48,  60,  66,
        89,  42,  57,  70,  70,  69,  52,  67,  76,  87,  82,  73,  75,
        64,  41,  90,  59,  51,  45,  54,  87,  72,  94,  45,  61,  60,
        77,  85,  78,  49,  71,  48,  62,  56,  65,  69,  68,  61,  74,
        64,  77,  58,  60,  73,  75,  58,  66,  39,  64,  23,  74,  40,
        90,  91,  64,  59,  80,  71,  61,  87,  82,  62,  97,  75,  65,
        52,  87,  53,  81,  39,  71,  97,  82,  59,  61,  78,  49,  59,
        70,  82,  90,  43,  80,  81,  57,  59,  64,  63,  71,  64,  55,
        51,  62,  93,  54,  69,  44,  86,  85,  50,  88,  59,  32,  36,
        63,  67,  65,  85,  73,  34,  93,  67,  88,  57,  79,  67,  70,
        50,  69,  52,  47,  46,  68, 100,  44,  57,  91,  69,  35,  72,
        54,  74,  74,  64,  65,  46,  48,  67,  62,  61,  70,  98,  70,
        67,  57,  85,  77,  72,  78,  81,  61,  58,  54,  82,  49,  49,
        57,  94,  75,  74,  58,  62,  72,  84,  92,  45,  75,  56,  48,
       100,  65,  72,  62,  66,  63,  68,  75,  89,  78,  53,  49,  54,
        64,  60,  62,  55,  91,   8,  81,  79,  78,  74,  57,  40,  81,
        44,  67,  86,  65,  55,  62,  63,  88,  62,  59,  68,  77])

In [ ]:
ds['math score'].value_counts()

65    36
62    35
59    32
69    32
73    27
      ..
22     1
19     1
18     1
8      1
0      1
Name: math score, Length: 81, dtype: int64

In [ ]:
ds['gender'].value_counts()  #this shows the number of 'female' and 'male' in the columns 'gender'

female    518
male      482
Name: gender, dtype: int64

In [ ]:
ds['math score'].std()   #this calaculates the standard deviation of the values in the 'math score' column

15.163080096009468

In [ ]:
ds['reading score'].std()   #this calaculates the standard deviation of the values in the 'reading score' column

14.60019193725222

In [ ]:
ds['math score'].median()     #this calaculates the median of the values in the 'math score' column

66.0

In [ ]:
ds['writing score'].median()      #this calaculates the median of the values in the 'writing' column

69.0

In [ ]:
ds['reading score'].median()     #this calaculates the median of the values in the 'reading score' column

70.0

In [ ]:
ds.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [ ]:
ds.gender.iloc[-1]

#iloc works with the numeric position of the index. This therefore is calling the last index in the table

'female'

In [ ]:
ds.dtypes.value_counts()

#this shows and counts all the data types of the data set

object    5
int64     3
dtype: int64

In [ ]:
ds.loc[2]

#this diplays all the information in index 2

gender                                  female
race/ethnicity                         group B
parental level of education    master's degree
lunch                                 standard
test preparation course                   none
math score                                  90
reading score                               95
writing score                               93
Name: 2, dtype: object

In [ ]:
ds.iloc[0]

#this diplays all the information in index 0

gender                                    female
race/ethnicity                           group B
parental level of education    bachelor's degree
lunch                                   standard
test preparation course                     none
math score                                    72
reading score                                 72
writing score                                 74
Name: 0, dtype: object

In [ ]:
ds[['gender','math score','reading score']]              #This is to select multiple columns

     gender  math score  reading score
0    female          72             72
1    female          69             90
2    female          90             95
3      male          47             57
4      male          76             78
..      ...         ...            ...
995  female          88             99
996    male          62             55
997  female          59             71
998  female          68             78
999  female          77             86

[1000 rows x 3 columns]

In [ ]:
ds[0:3]

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93

[3 rows x 8 columns]

In [ ]:
ds.iloc[0:3, 0:3]             #this is me specifying the rows and columns to be displayed

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree

In [5]:
ds.drop(columns = ['lunch','test preparation course'])      #his is used in dropping the non-useful columns in the dataFrame

     gender race/ethnicity  ... reading score  writing score
0    female        group B  ...            72             74
1    female        group C  ...            90             88
2    female        group B  ...            95             93
3      male        group A  ...            57             44
4      male        group C  ...            78             75
..      ...            ...  ...           ...            ...
995  female        group E  ...            99             95
996    male        group C  ...            55             55
997  female        group C  ...            71             65
998  female        group D  ...            78             77
999  female        group D  ...            86             86

[1000 rows x 6 columns]

In [7]:
dy = ds.drop(columns = ['lunch', 'test preparation course']) #assigning a variable name(dy) to function that dropped some columns that are not useful 
dy                                                           #i'm calling the variable

     gender race/ethnicity  ... reading score  writing score
0    female        group B  ...            72             74
1    female        group C  ...            90             88
2    female        group B  ...            95             93
3      male        group A  ...            57             44
4      male        group C  ...            78             75
..      ...            ...  ...           ...            ...
995  female        group E  ...            99             95
996    male        group C  ...            55             55
997  female        group C  ...            71             65
998  female        group D  ...            78             77
999  female        group D  ...            86             86

[1000 rows x 6 columns]

In [9]:
ds[['math score', 'writing score', 'reading score']]    #this is me calling the columns i want to work with

     math score  writing score  reading score
0            72             74             72
1            69             88             90
2            90             93             95
3            47             44             57
4            76             75             78
..          ...            ...            ...
995          88             95             99
996          62             55             55
997          59             65             71
998          68             77             78
999          77             86             86

[1000 rows x 3 columns]

In [10]:
dx = ds[['math score', 'writing score', 'reading score']]     #i am assigning a variable name to the columns i want to work with

In [11]:
dx/100

     math score  writing score  reading score
0          0.72           0.74           0.72
1          0.69           0.88           0.90
2          0.90           0.93           0.95
3          0.47           0.44           0.57
4          0.76           0.75           0.78
..          ...            ...            ...
995        0.88           0.95           0.99
996        0.62           0.55           0.55
997        0.59           0.65           0.71
998        0.68           0.77           0.78
999        0.77           0.86           0.86

[1000 rows x 3 columns]

In [14]:
ds['race/ethnicity'].value_counts()    #this counts the number of times each group appear in the column

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [25]:
race = ds['race/ethnicity']                  #thsi is me assigning a value name(race) to the column 'race/ethnicity' 
race

0      group B
1      group C
2      group B
3      group A
4      group C
        ...
995    group E
996    group C
997    group C
998    group D
999    group D
Name: race/ethnicity, Length: 1000, dtype: object

In [35]:
race.replace('group A', 'Yoruba', inplace=True)
race.replace('group B', 'Igbo', inplace=True)                  #this is me replacing the values in the column with another and making it permanent
race.replace('group C', 'Hausa', inplace=True)
race.replace('group D', 'Edo', inplace=True)
race.replace('group E', 'Ibibio', inplace=True)

In [36]:
race

0        Igbo
1       Hausa
2        Igbo
3      Yoruba
4       Hausa
        ...
995    Ibibio
996     Hausa
997     Hausa
998       Edo
999       Edo
Name: race/ethnicity, Length: 1000, dtype: object

In [37]:
ds['race/ethnicity'] = race         #this is me replacing the values in the column 'race/ethnicity' with the ones i just created 'race'

In [38]:
ds

     gender race/ethnicity  ... reading score writing score
0    female           Igbo  ...            72            74
1    female          Hausa  ...            90            88
2    female           Igbo  ...            95            93
3      male         Yoruba  ...            57            44
4      male          Hausa  ...            78            75
..      ...            ...  ...           ...           ...
995  female         Ibibio  ...            99            95
996    male          Hausa  ...            55            55
997  female          Hausa  ...            71            65
998  female            Edo  ...            78            77
999  female            Edo  ...            86            86

[1000 rows x 8 columns]

In [44]:
math = ds['math score']
reading = ds['reading score']
writing = ds['writing score']

In [46]:
math.min(), reading.min(), writing.min()

(0, 17, 10)

In [47]:
math.max(), reading.max(), writing.max()

(100, 100, 100)